ninety_nine_cats/app/controllers/cats_controller.rb

  def index
    @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (1) LIMIT $1  [["LIMIT", 1]]

  def show
    @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    cat = Cat.new(cat_params)

    if cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def update
    cat = Cat.find_by(id: params[:id])

    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "sex" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "   Bobina"], ["color", "yellow"], ["sex", "F"], ["description", "Bobina's Burgers"], ["updated_at", "2018-11-14 02:05:39.251913"], ["id", 14]]